Tabrez-dev/Tiva-TM4C123GXL-Peripheral-Driver-Development/drivers/src/tm4c123x_ssi_driver.c
/*
 * tm4c123x_ssi_driver.c
 *
 *  Created on: 09-Jul-2025
 *      Author: tabrez
 */

#include "tm4c123x_ssi_driver.h"
#include <stdio.h>

/* External timestamp function for telemetry */
__attribute__((weak)) uint32_t GetTick(void) { return 0; }

/* External UART functions for telemetry (safe from ISR) */
__attribute__((weak)) void UART1_SendString(const char *str) { (void)str; }
__attribute__((weak)) void UART1_SendNumber(uint32_t num) { (void)num; }
__attribute__((weak)) void UART1_SendChar(char c) { (void)c; }

/* External statistics variables */
__attribute__((weak)) uint32_t queueMaxDepth = 0;
__attribute__((weak)) uint32_t totalOperations = 0;

static void SSI_TXE_InterruptHandle(SSI_Handle_t *pSSIHandle);
static void SSI_RXNE_InterruptHandle(SSI_Handle_t *pSSIHandle);
static void SSI_RT_InterruptHandle(SSI_Handle_t *pSSIHandle);
static void SSI_OVR_ErrInterruptHandle(SSI_Handle_t *pSSIHandle);

/***************************************************************************
 * @fn                          - SSI_PeriClockControl
 *
 * @brief                       - Enables or disables the peripheral clock for an SSI port in Run Mode
 *
 * @param[in]                   - pSSIx: Pointer to the SSI port base address (e.g., SSI0, SSI1)
 * @param[in]                   - EnorDi: Enable (1) or disable (0) the clock
 * @param[in]                   - none
 *
 * @return                      - none
 *
 * @Note                        - Waits for peripheral readiness after enabling to ensure stable operation.
 *                                Refer to TM4C123GH6PM datasheet, section 5.2.6 for clock gating details.
 */
void SSI_PeriClockControl(SSI_RegDef_t *pSSIx, uint8_t EnorDi)
{
    if (!pSSIx) return;  // Null pointer check

    if (EnorDi == ENABLE) {
        // Enable clock for the specified SSI port
        if (pSSIx == SSI0) {
            SSI0_PCLK_EN();
        } else if (pSSIx == SSI1) {
            SSI1_PCLK_EN();
        } else if (pSSIx == SSI2) {
            SSI2_PCLK_EN();
        } else if (pSSIx == SSI3) {
            SSI3_PCLK_EN();
        }

        // Wait for peripheral readiness with timeout
        uint32_t portBit = (pSSIx == SSI0) ? (1U << 0) :
                           (pSSIx == SSI1) ? (1U << 1) :
                           (pSSIx == SSI2) ? (1U << 2) :
                           (1U << 3);  // SSI3

        uint32_t timeout = 10000; // Maximum iterations to wait
        while (!(SYSCTL_PR->PRSSI & portBit) && timeout > 0) {
            timeout--;
        }
        // Note: Could add error handling here if timeout == 0
    } else {
        // Disable clock for the specified SSI port
        if (pSSIx == SSI0) {
            SSI0_PCLK_DIS();
        } else if (pSSIx == SSI1) {
            SSI1_PCLK_DIS();
        } else if (pSSIx == SSI2) {
            SSI2_PCLK_DIS();
        } else if (pSSIx == SSI3) {
            SSI3_PCLK_DIS();
        }
    }
}

/***************************************************************************
 * @fn                          - SSI_Init
 *
 * @brief                       - Initializes the SSI peripheral with the provided configuration
 *
 * @param[in]                   - pSSIHandle: Pointer to the SSI handle structure containing configuration
 *
 * @return                      - none
 *
 * @Note                        - Automatically enables the peripheral clock for the given SSI instance.
 *                              - You do NOT need to call SSI_PeriClockControl() separately.
 *                              - Configures SSI mode, clock speed, and other parameters as per handle settings.

 */
void SSI_Init(SSI_Handle_t *pSSIHandle)
{
    uint32_t tempCR0 = 0;
    uint32_t tempCR1 = 0;
    uint32_t cpsdvsr = (pSSIHandle->SSIConfig.SSI_SclkSpeed >> 8) & 0xFF;
    uint32_t scr     = (pSSIHandle->SSIConfig.SSI_SclkSpeed & 0xFF);

    //0. Enable SSI Clock
    SSI_PeriClockControl(pSSIHandle->pSSIx, ENABLE);
    // 1. Disable SSI before configuration
    pSSIHandle->pSSIx->CR1 &= ~(1U << SSI_SSICR1_SSE);  // Clear SSE to disable SSI

    // 2. Set device mode (Master/Slave)
    if (pSSIHandle->SSIConfig.SSI_DeviceMode == SSI_DEVICE_MODE_MASTER) {
        tempCR1 &= ~(1U << SSI_SSICR1_MS);  // MS = 0 → Master
    } else {
        tempCR1 |=  (1U << SSI_SSICR1_MS);  // MS = 1 → Slave
    }

    // 3. Frame Format: Freescale SPI / TI / Microwire
    tempCR0 |= (pSSIHandle->SSIConfig.SSI_FRF & 0x3U) << SSI_SSICR0_FRF;

    // 4. Data Size (4–16 bits) – DSS field [3:0]
    // Validate DSS is in range 0x3 to 0xF (4 to 16 bits)
    uint8_t dss_value = pSSIHandle->SSIConfig.SSI_DSS & 0xFU;
    if (dss_value < 0x3) {
        dss_value = 0x3; // Default to minimum 4-bit data size
    }
    tempCR0 |= dss_value << SSI_SSICR0_DSS;

    // 5. Clock Polarity and Phase
    tempCR0 |= (pSSIHandle->SSIConfig.SSI_SPO & 0x1U) << SSI_SSICR0_SPO;
    tempCR0 |= (pSSIHandle->SSIConfig.SSI_SPH & 0x1U) << SSI_SSICR0_SPH;

    // 6. Serial Clock Rate (SCR) field [15:8]
    tempCR0 |= (scr & 0xFFU) << SSI_SSICR0_SCR;

    // 7. Configure CR0 and CR1
    pSSIHandle->pSSIx->CR0 = tempCR0;
    pSSIHandle->pSSIx->CR1 = tempCR1;

    // 8. Configure Clock Prescale (CPSDVSR)
    if ((cpsdvsr < 2) || (cpsdvsr & 1)) {
        cpsdvsr = 2; // Must be even and ≥ 2
    }
    pSSIHandle->pSSIx->CPSR = cpsdvsr;

    // 9. BusConfig is handled in software: full-duplex by hardware default.
    // Higher-level APIs (e.g., transmit/receive) interpret SSI_BusConfig.

    // 10. Enable SSI
    pSSIHandle->pSSIx->CR1 |= (1U << SSI_SSICR1_SSE);
}



/***************************************************************************
 * @fn                          - SSI_DeInit
 *
 * @brief                       - Resets the SSI peripheral to its default state
 *
 * @param[in]                   - pSSIx: Pointer to the SSI base address (e.g., SSI0, SSI1)
 *
 * @return                      - none
 *
 * @Note                        - Disables the peripheral and resets all associated configuration.
 */
void SSI_DeInit(SSI_RegDef_t *pSSIx)
{
    // 1. Disable the SSI peripheral
    pSSIx->CR1 &= ~(1U << SSI_SSICR1_SSE);  // Clear SSE bit to disable SSI

    // 2. Clear control registers
    pSSIx->CR0 = 0x00000000;
    pSSIx->CR1 = 0x00000000;

