Tabrez-dev/Tiva-TM4C123GXL-Peripheral-Driver-Development/drivers/src/tm4c123x_ssi_driver.c
    // 3. Clear prescaler
    pSSIx->CPSR = 0x00000000;

    // 4. Clear interrupt mask
    pSSIx->IM = 0x00000000;

    // 5. Clear interrupt status (write 1s to clear)
    pSSIx->ICR = (1U << SSI_SSIICR_RORIC) | (1U << SSI_SSIICR_RTIC);

    // 6. Optionally, clear DMA control
    pSSIx->DMACTL = 0x00000000;

}

/**
 * @fn      - SSI_GetStatus
 * @brief   - Checks the status of a specific  in the SSI Status Register
 *
 * @param[in]  pSSIx : Pointer to the SSI peripheral base address
 * @param[in]  Flag  : One of the SSI_FLAG_x macros (e.g., SSI_FLAG_TNF)
 *
 * @return     FLAG_SET or FLAG_RESET
 */
uint8_t SSI_GetFlagStatus(SSI_RegDef_t *pSSIx, uint32_t Flag)
{
    if (pSSIx->SR & Flag)
    {
        return FLAG_SET;
    }
    return FLAG_RESET;
}


/***************************************************************************
 * @fn                          - SSI_SendData
 *
 * @brief                       - Sends data over the SSI (SPI) peripheral
 *
 * @param[in]                   - pSSIx: Pointer to the SSI base address (e.g., SSI0, SSI1)
 * @param[in]                   - pTxBuffer: Pointer to the transmit data buffer
 * @param[in]                   - Len: Number of data frames to transmit (not bytes)
 *                                For DSS 4-8 bits: each frame = 1 byte
 *                                For DSS 9-16 bits: each frame = 2 bytes (little-endian)
 *
 * @return                      - none
 *
 * @Note                        - Blocks until all data is transmitted.
 *                                DSS config in CR0 determines frame size (4-16 bits).
 *                                For 16-bit transfers, data is read as little-endian.
 */
void SSI_SendData(SSI_RegDef_t *pSSIx, void *pTxBuffer, uint32_t Len)
{
    uint8_t *pData = (uint8_t *)pTxBuffer;  // Cast void* to uint8_t* for byte manipulation
    
    while (Len > 0)
    {
        // 1. Wait until Transmit FIFO is not full
        while (SSI_GetFlagStatus(pSSIx, SSI_FLAG_TNF) == FLAG_RESET);

        // 2. Get DSS (Data Size Select): bits [3:0] of CR0
        uint8_t dss = (pSSIx->CR0 & 0xF);  // DSS encoding from 0x3 to 0xF (4 to 16 bits)

        if (dss <= 0x7)  // DSS = 0x3 to 0x7 → 4 to 8 bits
        {
            pSSIx->DR = *pData;
            pData++;
            Len--;
        }
        else // DSS = 0x8 to 0xF → 9 to 16 bits
        {
            // Safe 16-bit data read avoiding alignment issues
            uint16_t data16 = pData[0] | (pData[1] << 8);
            pSSIx->DR = data16;
            pData += 2;
            Len--;
        }
    }
    
    // 3. Wait for transmission to complete
    // Wait until transmit FIFO is empty
    while (SSI_GetFlagStatus(pSSIx, SSI_FLAG_TFE) == FLAG_RESET);
    
    // Wait until SSI is not busy
    while (SSI_GetFlagStatus(pSSIx, SSI_FLAG_BSY) == FLAG_SET);
}


/***************************************************************************
 * @fn                          - SSI_ReceiveData
 *
 * @brief                       - Receives data from the SSI peripheral
 *
 * @param[in]                   - pSSIx: Pointer to the SSI base address (e.g., SSI0, SSI1)
 * @param[in]                   - pRxBuffer: Pointer to the receive data buffer
 * @param[in]                   - Len: Number of data elements to receive
 *
 * @return                      - none
 *
 * @Note                        - Blocks until all data is received.
 *                                DSS config in CR0 determines whether each element is 8 or 16 bits.
 */
void SSI_ReceiveData(SSI_RegDef_t *pSSIx, void *pRxBuffer, uint32_t Len)
{
    uint8_t *pData = (uint8_t *)pRxBuffer;  // Cast void* to uint8_t* for byte manipulation
    
    while (Len > 0)
    {
        // 1. Wait until Receive FIFO is not empty (RNE flag)
        while (SSI_GetFlagStatus(pSSIx, SSI_FLAG_RNE) == FLAG_RESET);

        // 2. Get DSS (Data Size Select): bits [3:0] of CR0
        uint8_t dss = (pSSIx->CR0 & 0xF);  // DSS encoding from 0x3 to 0xF (4 to 16 bits)

        if (dss <= 0x7)  // DSS = 0x3 to 0x7 → 4 to 8 bits
        {
            // Read DR for 1 byte of data and increment the rx buffer address
            *pData = (uint8_t)(pSSIx->DR & 0xFF);  
            /* Masking with 0xFF ensures we only get the lower 8 bits.
             * The DR register is 16 bits wide, but when configured for 8-bit data,
             * only the lower 8 bits contain valid data. The upper 8 bits may contain
             * garbage or undefined values. Masking prevents these unwanted bits
             * from being stored in our receive buffer.
             */
            pData++;
            Len--;
        }
        else // DSS = 0x8 to 0xF → 9 to 16 bits
        {
            // Read DR for 2 bytes of data - safe alignment method
            uint16_t data16 = (uint16_t)(pSSIx->DR & 0xFFFF);
            /* Masking with 0xFFFF ensures we only get the lower 16 bits.
             * Although DR is already 16 bits, this mask is a defensive programming
             * practice that ensures no sign extension or compiler-specific behavior
             * affects our data. It explicitly shows we want exactly 16 bits of data,
             * making the code more portable and clear in intent.
             */

            // Copy bytes individually to avoid alignment issues
            pData[0] = (uint8_t)(data16 & 0xFF);        // Low byte
            pData[1] = (uint8_t)((data16 >> 8) & 0xFF); // High byte
            pData += 2;
            Len--;
        }
    }
}

/***************************************************************************
 * @fn                          - SSI_SendDataIT
 *
 * @brief                       - Sends data over SSI using interrupt mode
 *
 * @param[in]                   - pSSIHandle: Pointer to the SSI handle structure
 * @param[in]                   - pTxBuffer: Pointer to the transmit data buffer
 * @param[in]                   - Len: Number of data frames to transmit
 *
 * @return                      - none
 *
 * @Note                        - Non-blocking transmission using FIFO interrupts
 */
uint8_t SSI_SendDataIT(SSI_Handle_t *pSSIHandle, void *pTxBuffer, uint32_t Len)
{
    uint8_t state = pSSIHandle->TxState;
    if (state != SSI_BUSY_IN_TX)
    {
        // 1. Save the Tx buffer address and Len information in some global variables
        pSSIHandle->pTxBuffer = (uint8_t *)pTxBuffer;
        pSSIHandle->TxLen = Len;
        // 2. Mark the SSI state as busy in transmission so that
        //    no other code can take over same SSI peripheral until transmission is over
        pSSIHandle->TxState = SSI_BUSY_IN_TX;
        // 3. Enable the TXIM control bit to get interrupt whenever TXE flag is set in SR
        pSSIHandle->pSSIx->IM |= (1 << SSI_SSIIM_TXIM);
        // 4. Data Transmission will be handled by the ISR code (will implement later)
    }
    return state;
}
/***************************************************************************
 * @fn                          - SSI_ReceiveDataIT
 *
 * @brief                       - Receives data over SSI using interrupt mode
 *
 * @param[in]                   - pSSIHandle: Pointer to the SSI handle structure
 * @param[in]                   - pRxBuffer: Pointer to the receive data buffer
 * @param[in]                   - Len: Number of data frames to receive
 *
 * @return                      - none
 *
 * @Note                        - Non-blocking reception using FIFO interrupts
 */
uint8_t SSI_ReceiveDataIT(SSI_Handle_t *pSSIHandle, void *pRxBuffer, uint32_t Len)
{
    uint8_t state = pSSIHandle->RxState;
    if (state != SSI_BUSY_IN_RX)
    {
        // 1. Save the Rx buffer address and Len information in some global variables
        pSSIHandle->pRxBuffer = (uint8_t *)pRxBuffer;
        pSSIHandle->RxLen = Len;
        // 2. Mark the SSI state as busy in reception so that
        //    no other code can take over same SSI peripheral until reception is over
        pSSIHandle->RxState = SSI_BUSY_IN_RX;
        // 3. Enable the RXIM control bit to get interrupt whenever RNE flag is set in SR
        pSSIHandle->pSSIx->IM |= (1 << SSI_SSIIM_RXIM);
    }
    return state;
}

/***************************************************************************
 * @fn                          - SPI_IRQInterruptConfig
 *
 * @brief                       - Configures the SPI interrupt in the NVIC
 *
 * @param[in]                   - IRQNumber: Interrupt number for the SPI peripheral
 * @param[in]                   - EnorDi: Enable (1) or disable (0) the interrupt
 * @param[in]                   - none
 *
 * @return                      - none
 *
 * @Note                        - Configures the NVIC for the specified interrupt number.
 */
void SSI_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi)
{
    if (EnorDi == ENABLE)
    {
        // Enable IRQ in NVIC using the NVIC_ENx registers
        if (IRQNumber < 32)
        {
            NVIC_EN0 |= (1 << IRQNumber);
        }
        else if (IRQNumber < 64)
        {
            NVIC_EN1 |= (1 << (IRQNumber - 32));
        }
        else if (IRQNumber < 96)
        {
            NVIC_EN2 |= (1 << (IRQNumber - 64));
        }
        else if (IRQNumber < 128)
        {
            NVIC_EN3 |= (1 << (IRQNumber - 96));
        }
    }
    else
    {
        // Disable IRQ in NVIC using the NVIC_DISx registers
        if (IRQNumber < 32)
        {
            NVIC_DIS0 |= (1 << IRQNumber);
        }
        else if (IRQNumber < 64)
        {
            NVIC_DIS1 |= (1 << (IRQNumber - 32));
        }
        else if (IRQNumber < 96)
        {
            NVIC_DIS2 |= (1 << (IRQNumber - 64));
        }
        else if (IRQNumber < 128)
        {
            NVIC_DIS3 |= (1 << (IRQNumber - 96));
        }
    }
}

/***************************************************************************
 * @fn                          - SPI_IRQPriorityConfig
 *
 * @brief                       - Configures the priority of the SPI interrupt
 *
 * @param[in]                   - IRQNumber: Interrupt number for the SPI peripheral
 * @param[in]                   - IRQPriority: Priority level for the interrupt
 * @param[in]                   - none
 *
 * @return                      - none
 *
 * @Note                        - Sets the priority in the NVIC for the specified interrupt.
 */
void SSI_IRQPriorityConfig(uint8_t IRQNumber, uint8_t IRQPriority)
{
    // Set priority
    uint8_t iprx = IRQNumber / 4;
    uint8_t section = IRQNumber % 4;
    // ARM Cortex-M4 usually supports 3 bits for priority (high 3 bits of 8)
    uint32_t shift = (8 * section) + (8 - __NVIC_PRIO_BITS); // __NVIC_PRIO_BITS = 3
    
