Tabrez-dev/Tiva-TM4C123GXL-Peripheral-Driver-Development/drivers/src/tm4c123x_ssi_driver.c
    // Calculate the address of the appropriate NVIC_PRIx register
    volatile uint32_t* priReg = (volatile uint32_t*)(NVIC_BASEADDR + NVIC_PRI_OFFSET + (iprx * 4));
    
    // Update the priority
    *priReg = (*priReg & ~(0xFF << shift)) | ((IRQPriority & 0x7) << shift);
}

/***************************************************************************
 * @fn                          - SPI_IRQHandling
 *
 * @brief                       - Handles the SPI interrupt service routine
 *
 * @param[in]                   - pHandle: Pointer to the SPI handle structure
 * @param[in]                   - none
 * @param[in]                   - none
 *
 * @return                      - none
 *
 * @Note                        - Processes interrupt events and clears interrupt flags.
 */
void SSI_IRQHandling(SSI_Handle_t *pSSIHandle)
{
    // Enter ISR

    // Check if this is a flash interface - use specialized handler
    if (pSSIHandle->isFlashInterface) {
        SSI_FlashInterruptHandler(pSSIHandle);
        return;
    }

    // Standard SSI interrupt handling for non-flash interfaces
    // Understand which event caused interrupt to trigger (check SSIMIS)
    uint32_t temp1, temp2;

    // Check for TX FIFO interrupt (TXMIS)
    temp1 = pSSIHandle->pSSIx->MIS & (1 << SSI_SSIMIS_TXMIS);
    temp2 = pSSIHandle->pSSIx->IM & (1 << SSI_SSIIM_TXIM);

    if (temp1 && temp2)
    {
        // Interrupt is due to setting of TNF flag (TX FIFO not full)
        // Handle TNF event (TX transmission)
        SSI_TXE_InterruptHandle(pSSIHandle);
    }

    // Check for RX FIFO interrupt (RXMIS)
    temp1 = pSSIHandle->pSSIx->MIS & (1 << SSI_SSIMIS_RXMIS);
    temp2 = pSSIHandle->pSSIx->IM & (1 << SSI_SSIIM_RXIM);

    if (temp1 && temp2)
    {
        // Interrupt is due to setting of RNE flag (RX FIFO not empty)
        // Handle RNE event (RX reception)
        SSI_RXNE_InterruptHandle(pSSIHandle);
    }

    // Check for RX Timeout interrupt (RTMIS)
    temp1 = pSSIHandle->pSSIx->MIS & (1 << SSI_SSIMIS_RTMIS);
    temp2 = pSSIHandle->pSSIx->IM & (1 << SSI_SSIIM_RTIM);

    if (temp1 && temp2)
    {
        // Interrupt is due to setting of RX Timeout flag (≥32 bit-times)
        // Handle RX Timeout event
        SSI_RT_InterruptHandle(pSSIHandle);
    }

    // Check for RX Overrun Error (RORMIS)
    temp1 = pSSIHandle->pSSIx->MIS & (1 << SSI_SSIMIS_RORMIS);
    temp2 = pSSIHandle->pSSIx->IM & (1 << SSI_SSIIM_RORIM);

    if (temp1 && temp2)
    {
        // Interrupt is due to setting of RX Overrun ERROR flag
        // Handle Error (clear error and notify application)
        SSI_OVR_ErrInterruptHandle(pSSIHandle);
    }
}

static void SSI_TXE_InterruptHandle(SSI_Handle_t *pSSIHandle)
{
    //1. Get DSS (Data Size Select): bits [3:0] of CR0
    uint8_t dss = (pSSIHandle->pSSIx->CR0 & 0xF); // DSS encoding from 0x3 to 0xF (4 to 16 bits)

    if (dss <= 0x7) // DSS = 0x3 to 0x7 → 4 to 8 bits
    {
        //2. Write one byte to SSI Data register (DR)
        pSSIHandle->pSSIx->DR = *pSSIHandle->pTxBuffer;
        pSSIHandle->pTxBuffer++;
        pSSIHandle->TxLen--;
    }
    else // DSS = 0x8 to 0xF → 9 to 16 bits
    {
        //3. Write 2 bytes to SSI Data register (DR) - safe alignment method
        uint16_t data16 = pSSIHandle->pTxBuffer[0] | (pSSIHandle->pTxBuffer[1] << 8);
        pSSIHandle->pSSIx->DR = data16;
        pSSIHandle->pTxBuffer += 2;
        pSSIHandle->TxLen--;
    }

    if (!pSSIHandle->TxLen)
    {
        //4. TxLen is zero, so close the ssi transmission and inform the application that
        //   TX is over
        //5. This prevents interrupts from setting up of TXE flag
        SSI_CloseTransmission(pSSIHandle);
        SSI_ApplicationEventCallback(pSSIHandle, SSI_EVENT_TX_CMPLT);
    }
}

static void SSI_RXNE_InterruptHandle(SSI_Handle_t *pSSIHandle)
{
    //1. Do RX as long as RNE flag is set and we have data to receive
    while ((pSSIHandle->pSSIx->SR & SSI_FLAG_RNE) && (pSSIHandle->RxLen > 0))
    {
        //2. Get DSS (Data Size Select): bits [3:0] of CR0
        uint8_t dss = (pSSIHandle->pSSIx->CR0 & 0xF); // DSS encoding from 0x3 to 0xF (4 to 16 bits)

        if (dss <= 0x7) // DSS = 0x3 to 0x7 → 4 to 8 bits
        {
            //3. Read one byte from SSI Data register (DR) and mask to 8 bits
            *pSSIHandle->pRxBuffer = (uint8_t)(pSSIHandle->pSSIx->DR & 0xFF);
            pSSIHandle->pRxBuffer++;
            pSSIHandle->RxLen--;
        }
        else // DSS = 0x8 to 0xF → 9 to 16 bits
        {
            //4. Read 2 bytes from SSI Data register (DR) - safe alignment method
            uint16_t data16 = (uint16_t)(pSSIHandle->pSSIx->DR & 0xFFFF);
            // Copy bytes individually to avoid alignment issues
            pSSIHandle->pRxBuffer[0] = (uint8_t)(data16 & 0xFF);        // Low byte
            pSSIHandle->pRxBuffer[1] = (uint8_t)((data16 >> 8) & 0xFF); // High byte
            pSSIHandle->pRxBuffer += 2;
            pSSIHandle->RxLen--;
        }
    }

    if (!pSSIHandle->RxLen)
    {
        //5. RxLen is zero, so close the SSI reception and inform the application that
        //   RX is over

        //6. This prevents interrupts from setting up of RNE flag
        SSI_CloseReception(pSSIHandle);
        SSI_ApplicationEventCallback(pSSIHandle, SSI_EVENT_RX_CMPLT);
    }
}

static void SSI_RT_InterruptHandle(SSI_Handle_t *pSSIHandle)
{
    //1. Read any remaining data from RX FIFO before clearing timeout
    //   Datasheet: "RX timeout occurs when FIFO has data but no new data for ≥32 bit-times"
    //   This means FIFO may still contain valid data that needs to be read
    while ((pSSIHandle->pSSIx->SR & SSI_FLAG_RNE) && (pSSIHandle->RxLen > 0))
    {
        //2. Get DSS (Data Size Select): bits [3:0] of CR0
        uint8_t dss = (pSSIHandle->pSSIx->CR0 & 0xF); // DSS encoding from 0x3 to 0xF (4 to 16 bits)

        if (dss <= 0x7) // DSS = 0x3 to 0x7 → 4 to 8 bits
        {
            //3. Read one byte from SSI Data register (DR) and mask to 8 bits
            *pSSIHandle->pRxBuffer = (uint8_t)(pSSIHandle->pSSIx->DR & 0xFF);
            pSSIHandle->pRxBuffer++;
            pSSIHandle->RxLen--;
        }
        else // DSS = 0x8 to 0xF → 9 to 16 bits
        {
            //4. Read 2 bytes from SSI Data register (DR) - safe alignment method
            uint16_t data16 = (uint16_t)(pSSIHandle->pSSIx->DR & 0xFFFF);
            // Copy bytes individually to avoid alignment issues
            pSSIHandle->pRxBuffer[0] = (uint8_t)(data16 & 0xFF);        // Low byte
            pSSIHandle->pRxBuffer[1] = (uint8_t)((data16 >> 8) & 0xFF); // High byte
            pSSIHandle->pRxBuffer += 2;
            pSSIHandle->RxLen--;
        }
    }

    //5. Clear the timeout flag (must be done AFTER reading FIFO per datasheet)
    //   Datasheet: "ISR should clear timeout interrupt just after reading out the RX FIFO"
    pSSIHandle->pSSIx->ICR |= (1 << SSI_SSIICR_RTIC);

    //6. Inform the application about timeout event
    //   Application can decide if this indicates end of packet or communication error
    SSI_ApplicationEventCallback(pSSIHandle, SSI_EVENT_TIMEOUT);
}

