Tabrez-dev/Tiva-TM4C123GXL-Peripheral-Driver-Development/drivers/src/tm4c123x_ssi_driver.c
static void SSI_OVR_ErrInterruptHandle(SSI_Handle_t *pSSIHandle)
{
    /* temp variable used to read DR/SR registers without storing the values
     * This prevents compiler warnings about unused return values from register reads
     * while still allowing the hardware side effects of reading these registers */
    uint8_t temp;

    /* Clear OVR flag - TM4C123GXL requires writing to ICR register */
    if (pSSIHandle->TxState != SSI_BUSY_IN_TX)
    {
        temp = pSSIHandle->pSSIx->DR;  // Read any available data
        temp = pSSIHandle->pSSIx->SR;  // Read status
    }
    /* TM4C123GXL specific: Write to ICR to clear overrun interrupt */
    pSSIHandle->pSSIx->ICR |= (1 << SSI_SSIICR_RORIC);
    (void)temp;  // Explicitly mark temp as unused to avoid compiler warnings

    /* Inform application */
    SSI_ApplicationEventCallback(pSSIHandle, SSI_EVENT_OVR_ERR);
}

/***************************************************************************
 * @fn                          - SSI_ClearOvrFlag
 *
 * @brief                       - Clears the SSI overrun error flag
 *
 * @param[in]                   - pSSIx: Pointer to the SSI base address (e.g., SSI0, SSI1)
 *
 * @return                      - none
 *
 * @Note                        - Used by application to manually clear overrun error after handling
 */
void SSI_ClearOvrFlag(SSI_RegDef_t *pSSIx)
{
    pSSIx->ICR |= (1 << SSI_SSIICR_RORIC);
}

/***************************************************************************
 * @fn                          - SSI_CloseTransmission
 *
 * @brief                       - Closes SSI transmission and resets TX state
 *
 * @param[in]                   - pSSIHandle: Pointer to the SSI handle structure
 *
 * @return                      - none
 *
 * @Note                        - Disables TX interrupt, clears buffers, resets state to READY
 */
void SSI_CloseTransmission(SSI_Handle_t *pSSIHandle)
{
    pSSIHandle->pSSIx->IM &= ~(1 << SSI_SSIIM_TXIM);
    pSSIHandle->pTxBuffer = NULL;
    pSSIHandle->TxLen = 0;
    pSSIHandle->TxState = SSI_READY;
}

/***************************************************************************
 * @fn                          - SSI_CloseReception
 *
 * @brief                       - Closes SSI reception and resets RX state
 *
 * @param[in]                   - pSSIHandle: Pointer to the SSI handle structure
 *
 * @return                      - none
 *
 * @Note                        - Disables RX interrupt, clears buffers, resets state to READY
 */
void SSI_CloseReception(SSI_Handle_t *pSSIHandle)
{
    pSSIHandle->pSSIx->IM &= ~(1 << SSI_SSIIM_RXIM);
    pSSIHandle->pRxBuffer = NULL;
    pSSIHandle->RxLen = 0;
    pSSIHandle->RxState = SSI_READY;
}

/***************************************************************************
 * @fn                          - SSI_ApplicationEventCallback
 *
 * @brief                       - Application callback function for SSI events
 *
 * @param[in]                   - pSSIHandle: Pointer to the SSI handle structure
 * @param[in]                   - AppEv: Event that triggered the callback (SSI_EVENT_TX_CMPLT, etc.)
 *
 * @return                      - none
 *
 * @Note                        - Weak implementation - application should override this function
 *                                to handle SSI events (TX complete, RX complete, errors, etc.)
 */
__weak void SSI_ApplicationEventCallback(SSI_Handle_t *pSSIHandle, uint8_t AppEv)
{
    // This is a weak implementation. The application may override this function.
}

/***************************************************************************
 * Flash Multi-Client Resource Manager Implementation
 ***************************************************************************/

/***************************************************************************
 * @fn                          - SSI_FlashResourceManagerInit
 *
 * @brief                       - Initializes the flash resource manager for multi-client operation
 *
 * @param[in]                   - pSSIHandle: Pointer to the SSI handle structure
 *
 * @return                      - none
 *
 * @Note                        - Must be called after SSI_Init() but before any flash operations
 */
void SSI_FlashResourceManagerInit(SSI_Handle_t *pSSIHandle)
{
    FlashResourceManager_t *pManager = &pSSIHandle->flashManager;

    // Initialize queue
    pManager->queueHead = 0;
    pManager->queueTail = 0;
    pManager->queueCount = 0;

    // Initialize state machine
    pManager->pCurrentOp = 0;
    pManager->currentState = FLASH_STATE_IDLE;
    pManager->cmdIndex = 0;
    pManager->cmdLength = 0;

    // Initialize status polling
    pManager->statusPollCount = 0;
    pManager->lastStatus = 0;

    // Initialize synchronization
    pManager->eventFlags = 0;
    pManager->resourceLocked = 0;

    // Clear command buffer
    for (uint8_t i = 0; i < 8; i++) {
        pManager->cmdBuffer[i] = 0;
    }

    // Mark this SSI interface as flash-enabled
    pSSIHandle->isFlashInterface = 1;
}

/***************************************************************************
 * @fn                          - SSI_FlashInit
 *
 * @brief                       - Complete flash interface initialization
 *
 * @param[in]                   - pSSIHandle: Pointer to the SSI handle structure
 *
 * @return                      - none
 *
 * @Note                        - Initializes SSI peripheral and flash resource manager
 */
void SSI_FlashInit(SSI_Handle_t *pSSIHandle)
{
    // Initialize the SSI peripheral first
    SSI_Init(pSSIHandle);

    // Initialize flash resource manager
    SSI_FlashResourceManagerInit(pSSIHandle);

    // DON'T enable SSI interrupts here - they will be enabled when an operation starts
    // Enabling them now causes immediate interrupt with no operation queued
    // pSSIHandle->pSSIx->IM |= (1U << SSI_SSIIM_TXIM) | (1U << SSI_SSIIM_RXIM);
}

/***************************************************************************
 * @fn                          - SSI_FlashQueueOperation
 *
 * @brief                       - Queues a flash operation for execution
 *
 * @param[in]                   - pSSIHandle: Pointer to the SSI handle structure
 * @param[in]                   - pRequest: Pointer to the flash operation request
 *
 * @return                      - 0: Success, 1: Queue full, 2: Invalid request
 *
 * @Note                        - Thread-safe operation queueing for multi-client access
 */
uint8_t SSI_FlashQueueOperation(SSI_Handle_t *pSSIHandle, FlashRequest_t *pRequest)
{
    if (!pSSIHandle->isFlashInterface || !pRequest) {
        return 2; // Invalid request
    }

    FlashResourceManager_t *pManager = &pSSIHandle->flashManager;

