Tabrez-dev/Tiva-TM4C123GXL-Peripheral-Driver-Development/drivers/src/tm4c123x_ssi_driver.c
    // Disable interrupts for atomic queue operation
    uint32_t primask = __get_PRIMASK();
    __disable_irq();

    // Check if queue is full
    if (pManager->queueCount >= FLASH_QUEUE_SIZE) {
        __set_PRIMASK(primask);
        UART1_SendString("[ResMan:SSI_FlashQueueOperation][");
        UART1_SendNumber(GetTick());
        UART1_SendString("ms][C");
        UART1_SendNumber(pRequest->clientId);
        UART1_SendString("] Queue FULL!\n");
        return 1; // Queue full
    }

    // Copy request to queue
    pManager->queue[pManager->queueTail] = *pRequest;
    pManager->queue[pManager->queueTail].status = FLASH_STATUS_PENDING;

    // Update queue pointers
    uint8_t queuePos = pManager->queueTail;
    pManager->queueTail = (pManager->queueTail + 1) % FLASH_QUEUE_SIZE;
    pManager->queueCount++;

    // Update queue statistics
    if (pManager->queueCount > queueMaxDepth) {
        queueMaxDepth = pManager->queueCount;
    }
    totalOperations++;

    // Set queue ready event flag
    SSI_FlashSetEventFlag(pSSIHandle, FLASH_EVENT_QUEUE_READY);

    UART1_SendString("[ResMan:SSI_FlashQueueOperation][");
    UART1_SendNumber(GetTick());
    UART1_SendString("ms][C");
    UART1_SendNumber(pRequest->clientId);
    UART1_SendString("] Queued (pos=");
    UART1_SendNumber(queuePos);
    UART1_SendString(", depth=");
    UART1_SendNumber(pManager->queueCount);
    UART1_SendString(")\n");

    // Re-enable interrupts (IMPORTANT: enable unconditionally, don't restore old state)
    // This ensures SSI_FlashProcessQueue runs with interrupts enabled
    __enable_irq();

    // Trigger queue processing if resource is available
    if (pManager->currentState == FLASH_STATE_IDLE) {
        SSI_FlashProcessQueue(pSSIHandle);
        UART1_SendString("[ResMan:SSI_FlashQueueOperation] ProcessQueue completed\n");
    } else {
        UART1_SendString("[ResMan:SSI_FlashQueueOperation][");
        UART1_SendNumber(GetTick());
        UART1_SendString("ms][C");
        UART1_SendNumber(pRequest->clientId);
        UART1_SendString("] WAITING (active=C");
        UART1_SendNumber(pManager->pCurrentOp->clientId);
        UART1_SendString(")\n");
    }

    UART1_SendString("[ResMan:SSI_FlashQueueOperation] Returning...\n");
    return 0; // Success
}

/***************************************************************************
 * @fn                          - SSI_FlashProcessQueue
 *
 * @brief                       - Processes the next operation in the flash queue
 *
 * @param[in]                   - pSSIHandle: Pointer to the SSI handle structure
 *
 * @return                      - none
 *
 * @Note                        - Called from interrupt context and main thread
 */
void SSI_FlashProcessQueue(SSI_Handle_t *pSSIHandle)
{
    FlashResourceManager_t *pManager = &pSSIHandle->flashManager;

    // Check if resource is busy or queue is empty
    if (pManager->currentState != FLASH_STATE_IDLE || pManager->queueCount == 0) {
        return;
    }

    // Disable interrupts for atomic queue operation
    __disable_irq();

    // Get next operation from queue
    pManager->pCurrentOp = &pManager->queue[pManager->queueHead];
    pManager->queueHead = (pManager->queueHead + 1) % FLASH_QUEUE_SIZE;
    pManager->queueCount--;

    // Re-enable interrupts (IMPORTANT: always enable, don't restore old state)
    __enable_irq();

    // Mark operation as active
    pManager->pCurrentOp->status = FLASH_STATUS_ACTIVE;

    // Initialize command sequence based on operation type
    switch (pManager->pCurrentOp->opType) {
        case FLASH_OP_READ_ID:
            pManager->cmdBuffer[0] = W25QXX_CMD_READ_JEDEC_ID;
            pManager->cmdLength = 1;
            break;

        case FLASH_OP_READ_STATUS:
            pManager->cmdBuffer[0] = W25QXX_CMD_READ_STATUS_REG1;
            pManager->cmdLength = 1;
            break;

        case FLASH_OP_WRITE_ENABLE:
            pManager->cmdBuffer[0] = W25QXX_CMD_WRITE_ENABLE;
            pManager->cmdLength = 1;
            break;

        case FLASH_OP_PAGE_PROGRAM:
            pManager->cmdBuffer[0] = W25QXX_CMD_PAGE_PROGRAM;
            pManager->cmdBuffer[1] = (uint8_t)((pManager->pCurrentOp->address >> 16) & 0xFF);
            pManager->cmdBuffer[2] = (uint8_t)((pManager->pCurrentOp->address >> 8) & 0xFF);
            pManager->cmdBuffer[3] = (uint8_t)(pManager->pCurrentOp->address & 0xFF);
            pManager->cmdLength = 4;
            break;

        case FLASH_OP_SECTOR_ERASE:
            pManager->cmdBuffer[0] = W25QXX_CMD_SECTOR_ERASE_4KB;
            pManager->cmdBuffer[1] = (uint8_t)((pManager->pCurrentOp->address >> 16) & 0xFF);
            pManager->cmdBuffer[2] = (uint8_t)((pManager->pCurrentOp->address >> 8) & 0xFF);
            pManager->cmdBuffer[3] = (uint8_t)(pManager->pCurrentOp->address & 0xFF);
            pManager->cmdLength = 4;
            break;

        case FLASH_OP_READ_DATA:
            pManager->cmdBuffer[0] = W25QXX_CMD_READ_DATA;
            pManager->cmdBuffer[1] = (uint8_t)((pManager->pCurrentOp->address >> 16) & 0xFF);
            pManager->cmdBuffer[2] = (uint8_t)((pManager->pCurrentOp->address >> 8) & 0xFF);
            pManager->cmdBuffer[3] = (uint8_t)(pManager->pCurrentOp->address & 0xFF);
            pManager->cmdLength = 4;
            break;

        default:
            // Invalid operation - mark as error
            pManager->pCurrentOp->status = FLASH_STATUS_ERROR;
            pManager->currentState = FLASH_STATE_ERROR;
            SSI_FlashSetEventFlag(pSSIHandle, FLASH_EVENT_ERROR);
            return;
    }

    // Start command phase
    pManager->currentState = FLASH_STATE_CMD_PHASE;
    pManager->cmdIndex = 0;

    UART1_SendString("[ResMan:SSI_FlashProcessQueue][");
    UART1_SendNumber(GetTick());
    UART1_SendString("ms][C");
    UART1_SendNumber(pManager->pCurrentOp->clientId);
    UART1_SendString("] Starting (IDLE->CMD)\n");

    // CS is now hardware-controlled by SSI2FSS (PB5)

    // Begin transmission by sending first command byte
    pSSIHandle->pSSIx->DR = pManager->cmdBuffer[pManager->cmdIndex++];

    // Enable TX and RX interrupts for flash operations (AFTER first DR write)
    // Directly set bits 2 and 3 (RXIM and TXIM)
    pSSIHandle->pSSIx->IM = 0x0C;  // Bits 2 and 3 for RX and TX interrupts

