Tabrez-dev/Tiva-TM4C123GXL-Peripheral-Driver-Development/drivers/src/tm4c123x_ssi_driver.c
    uint32_t im_after_write = pSSIHandle->pSSIx->IM;

    // DON'T print anything here - check if UART corrupts IM

    uint32_t im_after_delay = pSSIHandle->pSSIx->IM;

    // Now print both values
    UART1_SendString("[DEBUG] IM immediately after write=");
    UART1_SendNumber(im_after_write);
    UART1_SendString(", after delay=");
    UART1_SendNumber(im_after_delay);
    UART1_SendString(", PRIMASK=");
    UART1_SendNumber(__get_PRIMASK());
    UART1_SendString("\n");

    // Check NVIC pending register for SSI2 (IRQ 57, bit 25 of ISPR1)
    #define NVIC_ISPR1_ADDR 0xE000E204
    uint32_t ispr1_val = *((volatile uint32_t *)NVIC_ISPR1_ADDR);
    UART1_SendString("[DEBUG] NVIC_ISPR1=0x");
    UART1_SendNumber(ispr1_val);
    UART1_SendString(" (bit 25 for SSI2), RIS=0x");
    UART1_SendNumber(pSSIHandle->pSSIx->RIS);
    UART1_SendString("\n");

    // Manually kick the state machine since TX interrupt won't fire immediately
    // (TX FIFO not yet half-empty after writing just 1 byte)
    SSI_FlashStateMachine(pSSIHandle);

    UART1_SendString("[ResMan:SSI_FlashProcessQueue] State machine returned\n");
    UART1_SendString("[DEBUG] SR=0x");
    UART1_SendNumber(pSSIHandle->pSSIx->SR);
    UART1_SendString(", MIS=0x");
    UART1_SendNumber(pSSIHandle->pSSIx->MIS);
    UART1_SendString("\n");
}

/***************************************************************************
 * @fn                          - SSI_FlashSetEventFlag
 *
 * @brief                       - Sets an event flag in the flash resource manager
 *
 * @param[in]                   - pSSIHandle: Pointer to the SSI handle structure
 * @param[in]                   - flag: Event flag to set
 *
 * @return                      - none
 *
 * @Note                        - Atomic flag setting for interrupt communication
 */
void SSI_FlashSetEventFlag(SSI_Handle_t *pSSIHandle, uint32_t flag)
{
    uint32_t primask = __get_PRIMASK();
    __disable_irq();
    pSSIHandle->flashManager.eventFlags |= flag;
    __set_PRIMASK(primask);
}

/***************************************************************************
 * @fn                          - SSI_FlashGetEventFlags
 *
 * @brief                       - Gets current event flags from flash resource manager
 *
 * @param[in]                   - pSSIHandle: Pointer to the SSI handle structure
 *
 * @return                      - Current event flags
 *
 * @Note                        - Atomic flag reading for interrupt communication
 */
uint32_t SSI_FlashGetEventFlags(SSI_Handle_t *pSSIHandle)
{
    uint32_t primask = __get_PRIMASK();
    __disable_irq();
    uint32_t flags = pSSIHandle->flashManager.eventFlags;
    __set_PRIMASK(primask);
    return flags;
}

/***************************************************************************
 * @fn                          - SSI_FlashClearEventFlag
 *
 * @brief                       - Clears an event flag in the flash resource manager
 *
 * @param[in]                   - pSSIHandle: Pointer to the SSI handle structure
 * @param[in]                   - flag: Event flag to clear
 *
 * @return                      - none
 *
 * @Note                        - Atomic flag clearing for interrupt communication
 */
void SSI_FlashClearEventFlag(SSI_Handle_t *pSSIHandle, uint32_t flag)
{
    uint32_t primask = __get_PRIMASK();
    __disable_irq();
    pSSIHandle->flashManager.eventFlags &= ~flag;
    __set_PRIMASK(primask);
}

/***************************************************************************
 * @fn                          - SSI_FlashIsResourceAvailable
 *
 * @brief                       - Checks if flash resource is available for new operations
 *
 * @param[in]                   - pSSIHandle: Pointer to the SSI handle structure
 *
 * @return                      - 1: Available, 0: Busy
 *
 * @Note                        - Used by clients to check resource availability
 */
uint8_t SSI_FlashIsResourceAvailable(SSI_Handle_t *pSSIHandle)
{
    return (pSSIHandle->flashManager.currentState == FLASH_STATE_IDLE) ? 1 : 0;
}

/***************************************************************************
 * @fn                          - SSI_FlashStateMachine
 *
 * @brief                       - Executes the flash operation state machine
 *
 * @param[in]                   - pSSIHandle: Pointer to the SSI handle structure
 *
 * @return                      - none
 *
 * @Note                        - Called from interrupt handler to progress flash operations
 */
void SSI_FlashStateMachine(SSI_Handle_t *pSSIHandle)
{
    FlashResourceManager_t *pManager = &pSSIHandle->flashManager;
    volatile FlashRequest_t *pOp = pManager->pCurrentOp;

    // Debug: Log state machine entry
    static uint32_t smCallCount = 0;
    if (smCallCount < 20) {  // Limit to first 20 calls
        UART1_SendString("[SM:");
        UART1_SendNumber(smCallCount++);
        UART1_SendString("] state=");
        UART1_SendNumber(pManager->currentState);
        UART1_SendString(", idx=");
        UART1_SendNumber(pManager->cmdIndex);
        UART1_SendString("\n");
    }

    if (!pOp) return;

    switch (pManager->currentState) {
        case FLASH_STATE_CMD_PHASE:
            // Continue sending command bytes
            if (pManager->cmdIndex < pManager->cmdLength) {
                pSSIHandle->pSSIx->DR = pManager->cmdBuffer[pManager->cmdIndex++];
            } else {
                // Command phase complete
                SSI_FlashSetEventFlag(pSSIHandle, FLASH_EVENT_CMD_COMPLETE);

                // Determine next phase based on operation type
                switch (pOp->opType) {
                    case FLASH_OP_READ_ID:
                    case FLASH_OP_READ_STATUS:
                    case FLASH_OP_READ_DATA:
                        // Read operations - move to data receive phase
                        // CRITICAL: Drain RX FIFO of garbage bytes from command phase
                        while (pSSIHandle->pSSIx->SR & (1 << SSI_SSISR_RNE)) {
                            volatile uint32_t dummy = pSSIHandle->pSSIx->DR;
                            (void)dummy; // Suppress unused variable warning
                        }
                        pManager->currentState = FLASH_STATE_DATA_PHASE;
                        pManager->cmdIndex = 0; // Reuse as data index
                        break;

                    case FLASH_OP_WRITE_ENABLE:
                        // Simple command - operation complete
                        pManager->currentState = FLASH_STATE_COMPLETE;
                        break;

                    case FLASH_OP_PAGE_PROGRAM:
                        // Program operation - move to data send phase
                        pManager->currentState = FLASH_STATE_DATA_PHASE;
                        pManager->cmdIndex = 0; // Reuse as data index
                        break;

                    case FLASH_OP_SECTOR_ERASE:
                        // Erase operation - move to status polling
                        pManager->currentState = FLASH_STATE_STATUS_POLL;
                        pManager->statusPollCount = 0;
                        break;

                    default:
                        pManager->currentState = FLASH_STATE_ERROR;
                        break;
                }
            }
            break;

        case FLASH_STATE_DATA_PHASE:
            switch (pOp->opType) {
                case FLASH_OP_READ_ID:
                    // Read 3 bytes of JEDEC ID
                    if (pManager->cmdIndex < 3) {
                        // Check if TX FIFO has space - send dummy byte
                        if (pSSIHandle->pSSIx->SR & (1 << SSI_SSISR_TNF)) {
                            pSSIHandle->pSSIx->DR = 0xFF; // Dummy byte to clock data
                        }
                        // Check if RX FIFO has data - read received byte
                        if (pSSIHandle->pSSIx->SR & (1 << SSI_SSISR_RNE)) {
                            if (pOp->pData) {
                                pOp->pData[pManager->cmdIndex] = (uint8_t)(pSSIHandle->pSSIx->DR & 0xFF);
                            } else {
                                volatile uint32_t dummy = pSSIHandle->pSSIx->DR; // Drain FIFO
                                (void)dummy;
                            }
                            pManager->cmdIndex++;
                        }
                    } else {
                        pManager->currentState = FLASH_STATE_COMPLETE;
                    }
                    break;

