Tabrez-dev/Tiva-TM4C123GXL-Peripheral-Driver-Development/drivers/src/tm4c123x_ssi_driver.c
                case FLASH_OP_READ_STATUS:
                    // Read 1 byte of status
                    if (pManager->cmdIndex < 1) {
                        // Check if TX FIFO has space - send dummy byte
                        if (pSSIHandle->pSSIx->SR & (1 << SSI_SSISR_TNF)) {
                            pSSIHandle->pSSIx->DR = 0xFF; // Dummy byte
                        }
                        // Check if RX FIFO has data - read status byte
                        if (pSSIHandle->pSSIx->SR & (1 << SSI_SSISR_RNE)) {
                            pManager->lastStatus = (uint8_t)(pSSIHandle->pSSIx->DR & 0xFF);
                            if (pOp->pData) {
                                pOp->pData[0] = pManager->lastStatus;
                            }
                            pManager->cmdIndex++;
                        }
                    } else {
                        pManager->currentState = FLASH_STATE_COMPLETE;
                    }
                    break;

                case FLASH_OP_READ_DATA:
                    // Read data bytes
                    if (pManager->cmdIndex < pOp->dataLen) {
                        // Check if TX FIFO has space - send dummy byte
                        if (pSSIHandle->pSSIx->SR & (1 << SSI_SSISR_TNF)) {
                            pSSIHandle->pSSIx->DR = 0xFF; // Dummy byte to clock data
                        }
                        // Check if RX FIFO has data - read received byte
                        if (pSSIHandle->pSSIx->SR & (1 << SSI_SSISR_RNE)) {
                            if (pOp->pData) {
                                pOp->pData[pManager->cmdIndex] = (uint8_t)(pSSIHandle->pSSIx->DR & 0xFF);
                            } else {
                                volatile uint32_t dummy = pSSIHandle->pSSIx->DR; // Drain FIFO
                                (void)dummy;
                            }
                            pManager->cmdIndex++;
                        }
                    } else {
                        pManager->currentState = FLASH_STATE_COMPLETE;
                    }
                    break;

                case FLASH_OP_PAGE_PROGRAM:
                    // Send data bytes
                    if (pManager->cmdIndex < pOp->dataLen) {
                        uint8_t dataByte = pOp->pData ? pOp->pData[pManager->cmdIndex] : 0xFF;
                        pSSIHandle->pSSIx->DR = dataByte;
                        pManager->cmdIndex++;
                    } else {
                        // Data phase complete - move to status polling
                        pManager->currentState = FLASH_STATE_STATUS_POLL;
                        pManager->statusPollCount = 0;
                    }
                    break;

                default:
                    pManager->currentState = FLASH_STATE_ERROR;
                    break;
            }
            break;

        case FLASH_STATE_STATUS_POLL:
            // Poll status register for busy bit
            if (pManager->statusPollCount == 0) {
                // Send read status command
                pSSIHandle->pSSIx->DR = W25QXX_CMD_READ_STATUS_REG1;
                pManager->statusPollCount++;
            } else if (pManager->statusPollCount == 1) {
                // Send dummy byte and read status
                pSSIHandle->pSSIx->DR = 0xFF;
                pManager->lastStatus = (uint8_t)(pSSIHandle->pSSIx->DR & 0xFF);

                // Check if operation is complete (BUSY bit clear)
                if ((pManager->lastStatus & W25QXX_STATUS_BUSY) == 0) {
                    pManager->currentState = FLASH_STATE_COMPLETE;
                    SSI_FlashSetEventFlag(pSSIHandle, FLASH_EVENT_STATUS_READY);
                } else {
                    // Reset for next poll cycle
                    pManager->statusPollCount = 0;

                    // Check for timeout
                    uint32_t timeout = (pOp->opType == FLASH_OP_SECTOR_ERASE) ?
                                     FLASH_TIMEOUT_SECTOR_ERASE : FLASH_TIMEOUT_PAGE_PROGRAM;

                    if (pManager->statusPollCount > timeout) {
                        pOp->status = FLASH_STATUS_TIMEOUT;
                        pManager->currentState = FLASH_STATE_ERROR;
                    }
                }
            }
            break;

        case FLASH_STATE_COMPLETE:
            // CS is hardware-controlled, no manual control needed

            // Operation completed successfully
            pOp->status = FLASH_STATUS_COMPLETE;
            SSI_FlashSetEventFlag(pSSIHandle, FLASH_EVENT_OP_COMPLETE);

            UART1_SendString("[ResMan:SSI_FlashStateMachine][");
            UART1_SendNumber(GetTick());
            UART1_SendString("ms][C");
            UART1_SendNumber(pOp->clientId);
            UART1_SendString("] Operation SUCCESS\n");

            // Call completion callback if provided
            if (pOp->callback) {
                pOp->callback(pOp->clientId, pOp->status);
            }

            // Reset state machine for next operation
            pManager->currentState = FLASH_STATE_IDLE;
            pManager->pCurrentOp = 0;

            // Process next operation in queue if available
            SSI_FlashProcessQueue(pSSIHandle);
            break;

        case FLASH_STATE_ERROR:
            // CS is hardware-controlled, no manual control needed

            // Error occurred - mark operation as failed
            pOp->status = FLASH_STATUS_ERROR;
            SSI_FlashSetEventFlag(pSSIHandle, FLASH_EVENT_ERROR);

            UART1_SendString("[ResMan:SSI_FlashStateMachine][");
            UART1_SendNumber(GetTick());
            UART1_SendString("ms][C");
            UART1_SendNumber(pOp->clientId);
            UART1_SendString("] Operation FAILED\n");

            // Call completion callback if provided
            if (pOp->callback) {
                pOp->callback(pOp->clientId, pOp->status);
            }

            // Reset state machine for next operation
            pManager->currentState = FLASH_STATE_IDLE;
            pManager->pCurrentOp = 0;

            // Process next operation in queue if available
            SSI_FlashProcessQueue(pSSIHandle);
            break;

        default:
            // Invalid state - reset to idle
            pManager->currentState = FLASH_STATE_IDLE;
            break;
    }
}

/***************************************************************************
 * @fn                          - SSI_FlashInterruptHandler
 *
 * @brief                       - Flash-specific interrupt handler for SSI operations
 *
 * @param[in]                   - pSSIHandle: Pointer to the SSI handle structure
 *
 * @return                      - none
 *
 * @Note                        - Called from SSI_IRQHandling when flash interface is enabled
 */
void SSI_FlashInterruptHandler(SSI_Handle_t *pSSIHandle)
{
    uint32_t intStatus = pSSIHandle->pSSIx->MIS; // Masked interrupt status

    // Debug: Log interrupt entry
    static uint32_t irqCount = 0;
    if (irqCount < 10) {  // Limit to first 10 to avoid spam
        UART1_SendString("[IRQ:");
        UART1_SendNumber(irqCount++);
        UART1_SendString("] MIS=0x");
        UART1_SendNumber(intStatus);
        UART1_SendString("\n");
    }

    // Handle TX FIFO interrupt (can send more data)
    if (intStatus & (1U << SSI_SSIMIS_TXMIS)) {
        // TX FIFO is ready for more data
        SSI_FlashStateMachine(pSSIHandle);
    }

