Tabrez-dev/Tiva-TM4C123GXL-Peripheral-Driver-Development/drivers/src/tm4c123x_ssi_driver.c
    // Handle RX FIFO interrupt (data received)
    if (intStatus & (1U << SSI_SSIMIS_RXMIS)) {
        // RX FIFO has data available
        SSI_FlashStateMachine(pSSIHandle);
    }

    // Handle timeout interrupt
    if (intStatus & (1U << SSI_SSIMIS_RTMIS)) {
        // Clear timeout interrupt
        pSSIHandle->pSSIx->ICR |= (1 << SSI_SSIICR_RTIC);

        // Mark current operation as timeout error
        if (pSSIHandle->flashManager.pCurrentOp) {
            pSSIHandle->flashManager.pCurrentOp->status = FLASH_STATUS_TIMEOUT;
            pSSIHandle->flashManager.currentState = FLASH_STATE_ERROR;
            SSI_FlashSetEventFlag(pSSIHandle, FLASH_EVENT_ERROR);
        }
    }

    // Handle overrun error
    if (intStatus & (1U << SSI_SSIMIS_RORMIS)) {
        // Clear overrun interrupt
        pSSIHandle->pSSIx->ICR |= (1 << SSI_SSIICR_RORIC);

        // Mark current operation as error
        if (pSSIHandle->flashManager.pCurrentOp) {
            pSSIHandle->flashManager.pCurrentOp->status = FLASH_STATUS_ERROR;
            pSSIHandle->flashManager.currentState = FLASH_STATE_ERROR;
            SSI_FlashSetEventFlag(pSSIHandle, FLASH_EVENT_ERROR);
        }
    }
}

/***************************************************************************
 * @fn                          - SSI_FlashCancelOperation
 *
 * @brief                       - Cancels a queued flash operation for a specific client
 *
 * @param[in]                   - pSSIHandle: Pointer to the SSI handle structure
 * @param[in]                   - clientId: Client ID whose operation to cancel
 *
 * @return                      - 0: Success, 1: Operation not found, 2: Operation active
 *
 * @Note                        - Cannot cancel currently executing operations
 */
uint8_t SSI_FlashCancelOperation(SSI_Handle_t *pSSIHandle, uint8_t clientId)
{
    FlashResourceManager_t *pManager = &pSSIHandle->flashManager;

    // Disable interrupts for atomic queue operation
    uint32_t primask = __get_PRIMASK();
    __disable_irq();

    // Check if the current operation belongs to this client
    if (pManager->pCurrentOp && pManager->pCurrentOp->clientId == clientId) {
        __set_PRIMASK(primask);
        return 2; // Cannot cancel active operation
    }

    // Search queue for client's operation
    uint8_t index = pManager->queueHead;
    for (uint8_t i = 0; i < pManager->queueCount; i++) {
        if (pManager->queue[index].clientId == clientId) {
            // Mark operation as cancelled
            pManager->queue[index].status = FLASH_STATUS_CANCELLED;

            // Call completion callback if provided
            if (pManager->queue[index].callback) {
                pManager->queue[index].callback(clientId, FLASH_STATUS_CANCELLED);
            }

            // Remove from queue by shifting remaining operations
            for (uint8_t j = i; j < pManager->queueCount - 1; j++) {
                uint8_t currentIndex = (pManager->queueHead + j) % FLASH_QUEUE_SIZE;
                uint8_t nextIndex = (pManager->queueHead + j + 1) % FLASH_QUEUE_SIZE;
                pManager->queue[currentIndex] = pManager->queue[nextIndex];
            }

            pManager->queueCount--;
            __set_PRIMASK(primask);
            return 0; // Success
        }

        index = (index + 1) % FLASH_QUEUE_SIZE;
    }

    __set_PRIMASK(primask);
    return 1; // Operation not found
}

/***************************************************************************
 * @fn                          - SSI_FlashGetOperationStatus
 *
 * @brief                       - Gets the status of a client's flash operation
 *
 * @param[in]                   - pSSIHandle: Pointer to the SSI handle structure
 * @param[in]                   - clientId: Client ID to check status for
 *
 * @return                      - Operation status flags
 *
 * @Note                        - Returns current status of client's operation
 */
uint8_t SSI_FlashGetOperationStatus(SSI_Handle_t *pSSIHandle, uint8_t clientId)
{
    FlashResourceManager_t *pManager = &pSSIHandle->flashManager;

    // Check current operation
    if (pManager->pCurrentOp && pManager->pCurrentOp->clientId == clientId) {
        return pManager->pCurrentOp->status;
    }

    // Check queue
    uint8_t index = pManager->queueHead;
    for (uint8_t i = 0; i < pManager->queueCount; i++) {
        if (pManager->queue[index].clientId == clientId) {
            return pManager->queue[index].status;
        }
        index = (index + 1) % FLASH_QUEUE_SIZE;
    }

    return 0; // No operation found for this client
}

/***************************************************************************
 * SSI Interrupt Handlers
 ***************************************************************************/

/* External flash interface handle - weak stub for projects not using SSI2 */
__attribute__((weak)) SSI_Handle_t ssi2Flash = {0};

/*
 * SSI2 Interrupt Handler
 * Called by hardware when SSI2 interrupt fires
 */
void SSI2_IRQHandler(void) {
    if (ssi2Flash.pSSIx != NULL) {
        SSI_IRQHandling(&ssi2Flash);
    }
}
